app/controllers/adventures_controller.rb

  def index
    @adventures = Adventure.all
---
SELECT "adventures".* FROM "adventures" WHERE (user_id = 'user_id')

  def list_user
    @adventures = Adventure.where(user_id:  params[:user_id])
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."user_id" = $1 LIMIT $2  [["user_id", 18], ["LIMIT", 1]]

  def create
    @adventure = Adventure.new(adventure_params)

      if @adventure.save
---
INSERT INTO "adventures" ("name", "backgroud_image", "description", "user_id", "book_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @adventure.destroy
---
DELETE FROM "adventures" WHERE "adventures"."id" = $1  [["id", 4]]

    def set_adventure
      @adventure = Adventure.find(params[:id])
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]