app/controllers/players_controller.rb

  def list_players
    @players = Player.where(adventure_id: params[:adventure_id])
---
SELECT "players".* FROM "players" WHERE "players"."adventure_id" = $1  [["adventure_id", 17]]

  def create
    @player = Player.new(player_params)

      if @player.save
---
INSERT INTO "players" ("nickname", "description", "picture", "user_id", "adventure_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"