app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "teste1@teste"], ["LIMIT", 1]]
---
    def get_user_by_nickname
      @user = User.where("email LIKE ?", "%#{params[:nickname]}%").take